---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.TopOrInterior
enum: Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ
source: html/ec727cc0-0b36-7e43-371e-329300a73d61.htm
---
# Autodesk.Revit.DB.Structure.SurfaceElementProjectionZ.TopOrInterior

Top for floor or Interior Face for wall element.